code/openfoam/tutorials/incompressibleFluid/flowWithOpenBoundary/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

omegaInlet      1;

dimensions      [turbulentOmega];

internalField   uniform $omegaInlet;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform $omegaInlet;
    }

    "(atmosphere|outlet)"
    {
        type            inletOutlet;
        inletValue      uniform $omegaInlet;
    }

    walls
    {
        type            omegaWallFunction;
        value           uniform $omegaInlet;
    }

    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
